In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [2]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [3]:
%%sql
SELECT *
  FROM facts
 LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [4]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [5]:
%%sql
SELECT *
  FROM facts
 WHERE population = (SELECT MIN(population)
                       FROM facts
                    );

Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [6]:
%%sql
SELECT *
  FROM facts
 WHERE population = (SELECT MAX(population)
                       FROM facts
                    );

Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

In [7]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts
 WHERE name <> 'World';

Done.

[(0, 1367485388, 0.0, 4.02)]

In [8]:
%%sql
SELECT AVG(population), AVG(area)
  FROM facts
 WHERE name <> 'World';

Done.

[(32242666.56846473, 555093.546184739)]

In [9]:
%%sql
SELECT name AS 'Densely Populated Countries', population, area
  FROM facts
 WHERE population > (SELECT AVG(population)
                       FROM facts
                       WHERE name <> 'World'
                    ) 
   AND area <       (SELECT AVG(area)
                       FROM facts
                       WHERE name <> 'World'
                    )
   AND name <> 'World';

Done.

[('Bangladesh', 168957745, 148460),
 ('Germany', 80854408, 357022),
 ('Iraq', 37056169, 438317),
 ('Italy', 61855120, 301340),
 ('Japan', 126919659, 377915),
 ('Korea, South', 49115196, 99720),
 ('Morocco', 33322699, 446550),
 ('Philippines', 100998376, 300000),
 ('Poland', 38562189, 312685),
 ('Spain', 48146134, 505370),
 ('Thailand', 67976405, 513120),
 ('Uganda', 37101745, 241038),
 ('United Kingdom', 64088222, 243610),
 ('Vietnam', 94348835, 331210)]

In [10]:
%%sql
SELECT name AS 'country', population
  FROM facts
 WHERE name <> 'World'
 ORDER BY population DESC
 LIMIT 5;

Done.

[('China', 1367485388),
 ('India', 1251695584),
 ('European Union', 513949445),
 ('United States', 321368864),
 ('Indonesia', 255993674)]

In [11]:
%%sql
SELECT AVG(population), AVG(area)
  FROM facts
 WHERE name NOT IN ('World', 'European Union');

Done.

[(30235554.991666667, 539893.1895161291)]

In [12]:
%%sql
SELECT name AS 'country', population
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY population DESC
 LIMIT 5;

Done.

[('China', 1367485388),
 ('India', 1251695584),
 ('United States', 321368864),
 ('Indonesia', 255993674),
 ('Brazil', 204259812)]

In [13]:
%%sql
SELECT name AS 'Country', 
       population AS 'Population', 
       population_growth || ' %' AS 'Population growth rate'
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY population_growth DESC
 LIMIT 5;

Done.

[('South Sudan', 12042910, '4.02 %'),
 ('Malawi', 17964697, '3.32 %'),
 ('Burundi', 10742276, '3.28 %'),
 ('Niger', 18045729, '3.25 %'),
 ('Uganda', 37101745, '3.24 %')]

In [14]:
%%sql
SELECT name AS 'Country', 
       area_water AS 'Water area', 
       area_land AS 'Land area',
       CAST(area_water AS FLOAT) / area_land AS 'Ratio (water / land)' 
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY 'Ratio (water / land)' DESC
 LIMIT 5;

Done.

[('Afghanistan', 0, 652230, 0.0),
 ('Albania', 1350, 27398, 0.04927366961092051),
 ('Algeria', 0, 2381741, 0.0),
 ('Andorra', 0, 468, 0.0),
 ('Angola', 0, 1246700, 0.0)]

In [15]:
%%sql
SELECT name AS 'Country', 
       area_water AS 'Water area', 
       area_land AS 'Land area',
       CAST(area_water AS FLOAT) / area_land AS ratio 
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY ratio DESC
 LIMIT 5;

Done.

[('British Indian Ocean Territory', 54340, 60, 905.6666666666666),
 ('Virgin Islands', 1564, 346, 4.520231213872832),
 ('Puerto Rico', 4921, 8870, 0.5547914317925592),
 ('Bahamas, The', 3870, 10010, 0.3866133866133866),
 ('Guinea-Bissau', 8005, 28120, 0.2846728307254623)]

In [16]:
%%sql
SELECT name AS 'Country', 
       area_water AS 'Water area', 
       area_land AS 'Land area',
       ROUND(CAST(area_water AS FLOAT) / area_land, 2) 
       AS 'Ratio (water / land)' 
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY CAST(area_water AS FLOAT) / area_land DESC
 LIMIT 5;

Done.

[('British Indian Ocean Territory', 54340, 60, 905.67),
 ('Virgin Islands', 1564, 346, 4.52),
 ('Puerto Rico', 4921, 8870, 0.55),
 ('Bahamas, The', 3870, 10010, 0.39),
 ('Guinea-Bissau', 8005, 28120, 0.28)]

In [17]:
%%sql
SELECT name AS 'Country', 
       area_water AS 'Water area', 
       area AS 'Total area',
       ROUND(CAST(area_water AS FLOAT) / area * 100, 1) 
       AS 'Water (%)' 
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY CAST(area_water AS FLOAT) / area DESC
 LIMIT 5;

Done.

[('British Indian Ocean Territory', 54340, 54400, 99.9),
 ('Virgin Islands', 1564, 1910, 81.9),
 ('Puerto Rico', 4921, 13791, 35.7),
 ('Bahamas, The', 3870, 13880, 27.9),
 ('Guinea-Bissau', 8005, 36125, 22.2)]

In [18]:
%%sql
SELECT name AS 'Countries with more water than land', 
       area_water AS 'Water area',
       area_land AS 'Land area',
       area AS 'Total area',
       ROUND(CAST(area_water AS FLOAT) / area * 100, 1) 
       AS 'Water (%)' 
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
   AND area_water > area_land
 ORDER BY CAST(area_water AS FLOAT) / area DESC;

Done.

[('British Indian Ocean Territory', 54340, 60, 54400, 99.9),
 ('Virgin Islands', 1564, 346, 1910, 81.9)]

In [19]:
%%sql
SELECT name AS 'Country', 
       population AS 'Population', 
       ROUND(population * (population_growth / 100.0)) 
       AS 'Projected increase in population (YoY)'
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY population * (population_growth / 100.0) DESC
 LIMIT 5;

Done.

[('India', 1251695584, 15270686.0),
 ('China', 1367485388, 6153684.0),
 ('Nigeria', 181562056, 4448270.0),
 ('Pakistan', 199085847, 2906653.0),
 ('Ethiopia', 99465819, 2874562.0)]

In [20]:
%%sql
SELECT name AS 'Country', 
       population AS 'Population', 
       TRUNC(population * (population_growth / 100.0)) 
       AS 'Projected increase in population (YoY)'
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY population * (population_growth / 100.0) DESC
 LIMIT 5;

(sqlite3.OperationalError) no such function: TRUNC
[SQL: SELECT name AS 'Country',
       population AS 'Population',
       TRUNC(population * (population_growth / 100.0))
       AS 'Projected increase in population (YoY)'
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY population * (population_growth / 100.0) DESC
 LIMIT 5;]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [21]:
%%sql
SELECT name AS 'Country', 
       population AS 'Population', 
       CAST(ROUND(population * (population_growth / 100.0)) AS INT) 
       AS 'Projected increase in population (YoY)'
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY population * (population_growth / 100.0) DESC
 LIMIT 5;

Done.

[('India', 1251695584, 15270686),
 ('China', 1367485388, 6153684),
 ('Nigeria', 181562056, 4448270),
 ('Pakistan', 199085847, 2906653),
 ('Ethiopia', 99465819, 2874562)]

In [22]:
%%sql
SELECT name AS 'Countries in population decline', 
       population AS 'Population', 
       birth_rate AS 'Birth rate', 
       death_rate AS 'Death rate'
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
   AND death_rate > birth_rate
 ORDER BY death_rate - birth_rate DESC;

Done.

[('Bulgaria', 7186893, 8.92, 14.44),
 ('Serbia', 7176794, 9.08, 13.66),
 ('Latvia', 1986705, 10.0, 14.31),
 ('Lithuania', 2884433, 10.1, 14.27),
 ('Ukraine', 44429471, 10.72, 14.46),
 ('Hungary', 9897541, 9.16, 12.73),
 ('Germany', 80854408, 8.47, 11.42),
 ('Slovenia', 1983412, 8.42, 11.37),
 ('Romania', 21666350, 9.14, 11.9),
 ('Croatia', 4464844, 9.45, 12.18),
 ('Belarus', 9589689, 10.7, 13.36),
 ('Monaco', 30535, 6.65, 9.24),
 ('Greece', 10775643, 8.66, 11.09),
 ('Saint Pierre and Miquelon', 5657, 7.42, 9.72),
 ('Russia', 142423773, 11.6, 13.69),
 ('Estonia', 1265420, 10.51, 12.4),
 ('Portugal', 10825309, 9.27, 11.02),
 ('Japan', 126919659, 7.93, 9.51),
 ('Italy', 61855120, 8.74, 10.19),
 ('Bosnia and Herzegovina', 3867055, 8.87, 9.75),
 ('Czech Republic', 10644842, 9.63, 10.34),
 ('Moldova', 3546847, 12.0, 12.59),
 ('Poland', 38562189, 9.74, 10.19),
 ('Austria', 8665550, 9.41, 9.42)]

In [23]:
%%sql
SELECT name AS 'Country', 
       population AS 'Population', 
       area AS 'Area', 
       CAST(CAST(population AS FLOAT) / area AS INT) 
       AS 'Inhabitants / km(sq)'
  FROM facts
 WHERE name NOT IN ('World', 'European Union')
 ORDER BY CAST(population AS FLOAT) / area DESC
 LIMIT 5;

Done.

[('Macau', 592731, 28, 21168),
 ('Monaco', 30535, 2, 15267),
 ('Singapore', 5674472, 697, 8141),
 ('Hong Kong', 7141106, 1108, 6445),
 ('Gaza Strip', 1869055, 360, 5191)]

In [24]:
%%sql
SELECT name AS 'Country', 
       population AS 'Population', 
       area AS 'Area (km^2)', 
       CAST(CAST(population AS FLOAT) / area AS INT) 
       AS 'Inhabitants / km^2'
  FROM facts
 WHERE name NOT IN ('World', 'European Union', 
                    'Macau', 'Hong Kong', 'Gaza Strip')
 ORDER BY CAST(population AS FLOAT) / area DESC
 LIMIT 5;

Done.

[('Monaco', 30535, 2, 15267),
 ('Singapore', 5674472, 697, 8141),
 ('Gibraltar', 29258, 6, 4876),
 ('Bahrain', 1346613, 760, 1771),
 ('Maldives', 393253, 298, 1319)]

In [25]:
%%sql
SELECT name AS 'Country', 
       population AS 'Population', 
       area AS 'Area (km^2)', 
       CAST(CAST(population AS FLOAT) / area AS INT) 
       AS 'Inhabitants / km^2'
  FROM facts
 WHERE name NOT IN ('World', 'European Union', 
                    'Macau', 'Hong Kong', 'Gaza Strip',
                    'Gibraltar')
 ORDER BY CAST(population AS FLOAT) / area DESC
 LIMIT 5;

Done.

[('Monaco', 30535, 2, 15267),
 ('Singapore', 5674472, 697, 8141),
 ('Bahrain', 1346613, 760, 1771),
 ('Maldives', 393253, 298, 1319),
 ('Malta', 413965, 316, 1310)]